Penggunaan SQL & Phyton

In [5]:
import pymysql
import pandas as pd

In [6]:
db = pymysql.connect(host="localhost", user = "root", password = "06April1995.", database = "health")

query = "SELECT * FROM user_log"
data = db.cursor()
data.execute(query)

result = data.fetchall()
kolom = [kolom[0] for kolom in data.description]

df = pd.DataFrame(result, columns=kolom)
df

,id,log_date,measure,measure_value,systolic,diastolic
0,fa28f948a740320ad56b81a24744c8b81df119fa,2020-11-15,weight,46.00,0.00,0.00
1,1a7366eef15512d8f38133e7ce9778bce5b4a21e,2020-10-10,blood_glucose,97.00,0.00,0.00
2,bd7eece38fb4ec71b3282d60080d296c4cf6ad5e,2020-10-18,blood_glucose,120.00,0.00,0.00
3,0f7b13f3f0512e6546b8d2c0d56e564a2408536a,2020-10-17,blood_glucose,232.00,0.00,0.00
4,d14df0c8c1a5f172476b2a1b1f53cf23c6992027,2020-10-15,blood_pressure,140.00,140.00,113.00
...,...,...,...,...,...,...
56,054250c692e07a9fa9e62e345231df4b54ff435d,2020-10-02,blood_glucose,208.00,0.00,0.00
57,054250c692e07a9fa9e62e345231df4b54ff435d,2020-10-02,blood_glucose,206.00,0.00,0.00
58,054250c692e07a9fa9e62e345231df4b54ff435d,2020-10-02,blood_glucose,203.00,0.00,0.00
59,054250c692e07a9fa9e62e345231df4b54ff435d,2020-10-02,blood_glucose,198.00,0.00,0.00
60,054250c692e07a9fa9e62e345231df4b54ff435d,2020-10-02,blood_glucose,194.00,0.00,0.00

ASSIGNMENT A

In [19]:
import pymysql
import pandas as pd

In [20]:
db = pymysql.connect(host="localhost", user = "root", password = "06April1995.", database = "company")

query = "SELECT * FROM employees"
data = db.cursor()
data.execute(query)

result = data.fetchall()
kolom = [kolom[0] for kolom in data.description]

df = pd.DataFrame(result, columns=kolom)
df

,employee_id,first_name,last_name,department,salary,hire_date,manager_id
0,1,John,Doe,Human Resources,50000.00,2023-06-15,NaN
1,2,Jane,Smith,Finance,60000.00,2022-11-01,1.0
2,3,Emily,Johnson,Marketing,45000.00,2024-01-10,NaN
3,4,Michael,Williams,IT,70000.00,2021-04-20,1.0
4,5,Linda,Brown,Sales,55000.00,2022-09-15,3.0

1

In [27]:
print(df['salary'].sum())

280000.0

2

In [28]:
print(df.groupby('department')[['salary']].mean())

                  salary
department
Finance          60000.0
Human Resources  50000.0
IT               70000.0
Marketing        45000.0
Sales            55000.0

3

In [32]:
print(df['department'].value_counts())

department
Human Resources    1
Finance            1
Marketing          1
IT                 1
Sales              1
Name: count, dtype: int64

4

In [34]:
gaji_tertinggi = df['salary'].max()
gaji_terendah = df['salary'].min()

print(f"Gaji Tertinggi = {gaji_tertinggi}")
print(f"Gaji Terendah = {gaji_terendah}")

Gaji Tertinggi = 70000.0
Gaji Terendah = 45000.0

ASSIGNMENT B

1

In [35]:
unique_departments = df['department'].unique()

print(unique_departments)

['Human Resources' 'Finance' 'Marketing' 'IT' 'Sales']

2

In [37]:
data = {
    'first_name': ['John', 'Jane', 'Emily', 'Michael', 'Linda'],
    'last_name': ['Doe', 'Smith', 'Johnson', 'Williams', 'Brown']
}

df = pd.DataFrame(data)

grouped = df.groupby(['first_name', 'last_name']).size()

print(grouped)

first_name  last_name
Emily       Johnson      1
Jane        Smith        1
John        Doe          1
Linda       Brown        1
Michael     Williams     1
dtype: int64

ASSIGNMENT C

In [41]:
db = pymysql.connect(host="localhost", user = "root", password = "06April1995.", database = "company")

query = "SELECT * FROM employees"
data = db.cursor()
data.execute(query)

result = data.fetchall()
kolom = [kolom[0] for kolom in data.description]

df = pd.DataFrame(result, columns=kolom)
df

,employee_id,first_name,last_name,department,salary,hire_date,manager_id
0,1,John,Doe,Human Resources,50000.00,2023-06-15,NaN
1,2,Jane,Smith,Finance,60000.00,2022-11-01,1.0
2,3,Emily,Johnson,Marketing,45000.00,2024-01-10,NaN
3,4,Michael,Williams,IT,70000.00,2021-04-20,1.0
4,5,Linda,Brown,Sales,55000.00,2022-09-15,3.0

1

In [42]:
print(df.groupby('department')[['salary']].sum())

                   salary
department
Finance          60000.00
Human Resources  50000.00
IT               70000.00
Marketing        45000.00
Sales            55000.00

2

In [43]:
print(df['department'].value_counts())
print(df.groupby('department')[['salary']].sum())

department
Human Resources    1
Finance            1
Marketing          1
IT                 1
Sales              1
Name: count, dtype: int64
                   salary
department
Finance          60000.00
Human Resources  50000.00
IT               70000.00
Marketing        45000.00
Sales            55000.00

3

In [45]:
print(df.groupby('department')[['salary']].mean())

                  salary
department
Finance          60000.0
Human Resources  50000.0
IT               70000.0
Marketing        45000.0
Sales            55000.0